
def show_example1():
    requirements = '无'
    title = '狐狸和乌鸦新编'
    word_count = 0
    content = """
    森林里有一棵古老的大树，树枝上有一个乌鸦的家。下面的树洞里住着一只狐狸。
    有一天，乌鸦叼回来一块肉，得意地站在树枝上。狐狸看见了，忍不住流出口水，心想：“哇，那块肉一定很好吃，要是能咬上一口，该多好呀！”狐狸想了一会儿，想出一个主意。它咽了咽口水，笑着对乌鸦说：“亲爱的乌鸦，你好吗？”
    乌鸦眼就识破了狐狸的诡计，没有回答狐狸。它因为它一继续笑着说：“亲爱的乌鸦，您的孩子好吗？”乌鸦看了狐狸一眼，还是没有回答它。狐狸见乌鸦还是没回答，就说：“亲爱的乌鸦小姐，您的羽毛真漂亮，就连孔雀和你比起来都差远了！”
    乌鸦假装高兴，狐狸以为乌鸦快要上当了，就摇摇尾巴说：“您的嗓子真好，大家都爱听您唱歌，您就唱几句吧！”乌鸦假装更得意了，把肉叼回巢里，抖抖翅膀，准备放声歌唱。
    狐狸本想借唱歌的理由，让乌鸦张嘴使肉掉下来，趁机叼走的。可乌鸦现在这么聪明，狐狸就想爬上树去抢那块肉。但它不会爬树，爬到一半就摔下来了。狐狸再也不敢骗乌鸦了，它明白骗人是不好的。
    从此以后，它又变成了一个善良的狐狸。
    """
    return requirements, title, word_count, content

def show_example2():
    requirements = '无'
    title = '我的老师'
    word_count = 600
    content = """
    她让我最难忘的，应该算是本学期的第一节美术课了。说到这儿，你也许并不觉得会有什么稀奇，老师无非就是做个自我介绍，然后让我们画幅画，互相了解一下罢了。可这个陈老师不同，她穿着一件色彩极其鲜艳的衣服进了教室，接着又东看看西瞧瞧，忽然像发现了新大陆似的盯准了一堵墙，问我们：“谁来说说，这是什么颜色？”我们莫明其妙地望着陈老师，心想：这恐怕是问给3岁小孩的问题吧，是不是我们听错了？要不，准是老师走错地方了！
    “怎么没人回答呢？”老师虽然还是带着笑意在问，但看得出她的脸上渗出了一点失望的表情。
    我们这才齐声答道：“白色！”这么幼稚的问题，居然让老师一阵冷笑后，含着万分神秘的色彩，悄声对我们说：“再仔细想想。”老师这么一说，显然是我们答错了，可怎么会呢？全班同学都只好微微地摇摇头，静静地听老师讲解。陈老师先让一个穿着蓝颜色衣服的同学站到墙前面，说：“你们好好观察一下，除了白色，还有什么颜色？”“蓝色！”我们猜测到。　　
    陈老师淡淡一笑，点点头，又说：“如果一个穿黄色衣服的同学站在这儿，你们想想，墙上还有什么颜色？”噢，我明白了，墙要受其它物体颜色的影响，任何物体都一样，它的颜色并不是单纯的。同时，我也知道陈老师为什么要问那个所谓幼稚的问题了。接着，她给我们叙述了她遇到过的许多趣事。在一阵阵笑声中，我学到了很多东西，以及陈老师的教学原则。　　
    每节课，陈老师都会用不同的方式来吸引我们，让人倍感亲切，又觉得她高深莫测，因为谁也不知道这个怪老师还会有啥怪招儿！
    """
    return requirements, title, word_count, content

def show_example3():
    requirements = '无'
    title = '我的姐姐'
    word_count = 300
    content = """
    大家好，很开心又跟大家见面了，钱不是主要原因，主要原因是我姐姐在学校门口潜我。从很远的地方，我就看见下她笑起来合不拢的大嘴和她的大白牙，跟手上向我摇晃的百元大钞，我就知道，她又要收买我了。
    我的姐姐很墨迹。一家人约好了早上7点出门，8点了我们还在家里，妈妈催她快点，她就一边描眉一边嘟嘟：“求您了，再等我个五分钟。”她一直跟我强调说则幅眼前过，不泡是罪过，每天努力地泡帅哥。
    我的姐姐曾经为了民族团结，硬要背上氧气瓶，去西藏找丁真和亲，还问妈妈嫁远了能支持吗，我妈让她滚一边做梦去。后来才知道人家了真是四川的。
    喊她吃饭也不起，她想吃的东西通常活不过第二天，回奶奶家想吃鸡肉，想就一直说鸡啄她，鸡当天晚上就上桌了。
    现在每天晚上除了写作业，还得给她写一篇作文。她现在正跟鬼一样追在我后面问：“写完没？写完没？这么慢，打电报都比你快，这不行，得扣钱！谁都别想阻止我出道！”
    唉，我是真的真的很无语。
    """
    return requirements, title, word_count, content
