
def show_example1():
    requirements = '无'
    title = '美丽的苹果'
    word_count = 0
    content = """
    祖母爱吃苹果，尤其爱吃妈妈削的苹果。
    妈妈削苹果的姿势很漂亮。她安详地拿起水果刀，飞快地在苹果上转着，果皮便宛如一只轻轻点过水面的燕子，时而向下，时而朝上，绕着苹果自由地飞舞。片刻之后，圆圆的苹果便呈现在我们面前，完美得就像一件艺术品。
    削完后，妈妈总会拿过碟子，将苹果一片片削好，递给祖母。那一瞬间，妈妈那写满微笑的双眼那么美丽。祖母每每递给我几块，而我吃完后总是不懂事地嚷着还要。望着妈妈那似嗔却笑的样子，我是乐滋滋的。不过，心里总想，要是自己能吃上一个完整的苹果该多好啊！
    岁月流逝，祖母年纪渐渐大了，但仍然还和以前一样地搂着我看妈妈削苹果，妈妈依旧用她那灵巧的双手制作出一件件沁人心脾的“艺术品”。不同的是，我们每个人手里都有她亲手削出的大苹果。品着那甜甜的苹果，我时常想，要是自己也能够这样为祖母或妈妈削一次苹果，那该是一件多么快乐的事情啊！
    那年深秋，祖母病了，昏迷了好几天。我依然记得她那慈祥的容貌和那被疾病折磨的身子。那天，祖母奇迹般地睁开双眼，吃力地说着什么。我急忙把耳朵贴到祖母嘴唇边，才听清祖母说的是“苹……果”。
    爸爸在上班，妈妈上街了，谁来为祖母削苹果呢？看来只能自己动手了，我以最快的速度拿出一个又大又红的苹果，模仿妈妈的动作操作起来，可那小刀好像特意与我作对似的，我越想削好，刀子越不听使唤，深一刀浅一刀地，果皮果肉洒落了一地。当我颤抖着将那仅剩下半边的“丑八怪”递到祖母眼前时，却分明读到她脸上一种幸福的笑容。
    如今，祖母的病好了，我们晚饭后吃苹果的习惯还是没有改变。不过，水果刀已经掌管在我的手上。每每望着祖母和妈妈那惬意的笑脸，我感觉自己仿佛成了传递爱心的“小天使”，快乐着家人，也快乐着自己。
    """
    return requirements, title, word_count, content

def show_example2():
    requirements = '无'
    title = '门其实开着'
    word_count = 0
    content = """
    记忆之轮飞速旋转着，搜索着过往种种。闭眼，回忆，往事如烟；定格，播放，此事难忘。
    考试受挫，心中抑郁。某个星期六。妈妈说去灵山大佛，求佛保佑我学习天天向上。本无去意，但一想到考试，我就难受，想着也去拜拜，希望佛可以显灵。
    阴雨。长途颠簸，终于到站。雨细而密，极像我的心情。老妈牵着我的手，兴致勃勃，雷厉风行，刚跨过门槛就急着去买香，置我于不顾。我于是无目的地晃荡着闲逛。这应该属于寺庙吧，低矮的房子，古朴素雅。寺内游人络绎不绝。环顾四周，有一尊笑得极开怀的佛像，人们不停地去摸它的身子，希望得到保佑。
    我低着头，踢着地上的水行进着。我心中越发地憋屈，于是掉头跑进大堂，双膝跪地，两掌合十，闭眼，祈祷，三叩首。礼毕，我站起身朝后堂走去。
    没什么值得留恋。我一直走着，突然发现不远处有一小门，镶嵌在墙里面。门很矮，红色的漆已开始剥落，估计有些年头了。门栓上锈迹斑斑，门链看上去却显得比较显眼，锃亮的，错杂地来回缠绕着，千丝万缕，恨不得把整扇门都封锁起来。我抽出裤袋里的两只手，想去推，但又在半空中停住了。是锁了的。我这样想，又将两只手放回口袋之中。站在门前，我注视着这门，正欲转身离开，一个尼姑出现在我眼前。
    “为什么不试一试？”她微笑着问。
    “没什么好试的。”我面无表情地走。
    “谁说它一定是锁的呢？”于是我转身，往回走，木讷地盯着她，她微笑点头，示意我动手。我慢慢抽出手，用力推了一下粗糙的门面。门链利索地滑落另外，光透了进来，眼前是一片碧绿的菜畦。“跨过这道槛，前面就是平原。”她拍了拍我的肩走开了。
    原来豁然开朗的感觉是幸福的，当在阴暗的角落接收到一丝光明的时候，我发现门其实开着，门外阳光明媚！
    """
    return requirements, title, word_count, content

def show_example3():
    requirements = '无'
    title = '门其实开着'
    word_count = 0
    content = """
    窗外的雨淅淅沥沥，埋着头作业的我偶尔抬起头来，看着老师辅导学生的背影，我的心里也不禁飘起了绵绵小雨......
    我不算班里的尖子生，总是10名左右。中午、下课，老师不是辅导学习跟不上的同学，就是指导学习优异的同学。每当这时，我的心里不仅满是惆怅: 老师，为何您总把我置之度外?尽管我没有班长那统领全班的威信，也无课代表那认真负责的精神，更无学习委员那规规矩矩的学习态度，但我至少有着一颗为班级着想的心。有时我常想:如果，我是个差生多好!
    如果我是个差生。考试漏洞百出，作业马马虎虎，上课心不在焉，下课调皮捣蛋不过您依旧会不厌其烦地把我叫到您的跟前，一遍一遍地为我辅导功课。我进步时您冲我笑，然我能清晰地看到您美丽的睫毛;我开小差时您拍我的头，然我能零距离地观察您微微下垂的嘴角......是啊，那样该多好!
    如果我是个差生，虽不能用优异的成绩报答您的栽培，但上课时开的玩笑仍能让您嫣然一笑。碰巧的一次90分，仍能让您的心里荡起阵阵波涛。我宁可中午被叫出去重新默写，我还是可以把这看成您为我准备的YIP包厢:我宁可放学被留下，当校园静得出奇时，我还是可以聆听您沉重的呼吸;我宁可晚上学习直到夜阑人静，哪怕只有静谧的空气与我做伴，为的只是博得您的一句鼓励与夸赞.·····是啊，那样该多妙!
    老师啊，老师，虽然我的想法有些枯燥，但我有时还是想说一句: 我也想当一个差生
    """
    return requirements, title, word_count, content